// "© Copyright 2004-2013, 2015-2016 HP Development Company, L.P."

TaskName = "网络设置";
HSDTaskName = "网络设置";

ApplySettingsErrorHostNameFailed = "未设置主机名。请确保其格式有效。";
AddressInUseError = "指定的 IP 地址已被占用。";
AddressInUseErrorExplanation = "请指定另一个 IP 地址。";
IncorrectMaskErrorExplanation = "指定的子网掩码错误。请联系您的网络管理员以寻求帮助。";

IncorrectHostNameError = "“主机名”过长。";
IncorrectIpAddressError = "IP 地址格式不正确。";
ManualAddressEmptyError = "“IP 地址”字段不能为空。";
ManualAddressEmptyExplanation = "请指定有效的手动地址。";
ManualAddressWithPrefixExplanation = "请指定有效的 IP 地址和 1 至 128 之间的前缀长度。";
ManualAddressNotIPv4Explanation = "请指定有效的 IP 地址。";

STATELESS = "路由器";

ipV4TabName = "IPv4";
ipV6TabName = "IPv6";
OtherTabName = "其他设置";

kCheckChangesAlertTitleKey = "数据已更改。要继续吗？";
kCheckChangesAlertContinueButtonTitleKey = "继续";
kCheckChangesAlertCancelButtonTitleKey = "取消";
kCheckChangesAlertMessageKey = "若继续，所做更改将丢失。单击“取消”可放弃操作并继续执行任务。";

TaskNameTiger = "Bonjour 设置";
NoService = "服务不可用";
NoBonjourName = "不适用";

1ServiceName = "Port 9100";
2ServiceName = "IPP";
3ServiceName = "LPD-RAW";
4ServiceName = "LPD-TEXT";
5ServiceName = "LPD-AUTO";
6ServiceName = "LPD-BINPS";
7ServiceName = "LPD-Queue5";
8ServiceName = "LPD-Queue6";
9ServiceName = "LPD-Queue7";
10ServiceName = "LPD-Queue8";
11ServiceName = "LPD-Queue9";
12ServiceName = "LPD-Queue10";
13ServiceName = "LPD";
16ServiceName = "IPPS";

IPPSecureServiceName = "IPP (仅安全)";
IPPUnsecureServiceName = "IPP (仅不安全)";

IncorrectConfigurationTitle = "指定的配置不正确";
IncorrectConfigurationExplanation = "请选择正确的配置或联系您的网络管理员以寻求帮助。";

IncorrectDNSServerErrorExplanation = "请输入正确的 DNS 服务器地址，或联系您的网络管理员获得帮助。";
IncorrectGatewayAddressTitle = "指定的网关地址不正确";
IncorrectGatewayErrorExplanation = "请输入正确的网关地址或与网络管理员联系以获得帮助。";
GatewayIsNotInSubnetTitle = "输入的网关地址不是该设备的子网";
GatewayIsNotInSubnetExplanation = "请输入其他的 IP 地址、子网掩码或网关地址，或与网络管理员联系以获得帮助。";

AskSaveChangesAlertTitle = "您已更改此屏幕上的设置";
AskSaveChangesAlertMsg = "关闭之前是否要应用更改？";
AskSaveChangesDontApplyButtonTitle = "不应用";
AskSaveCahngesApplyButtonTitle = "应用";

TaskPanelOKButtonTitle = "确定";

EmptyBonjourServiceNameFieldTitle = "\"Bonjour 服务名称\" 字段不能为空";
EmptyBonjourServiceNameFieldMsg = "指定 Bonjour 服务名称。";
EmptyBonjourDomainNameFieldTitle = "“Bonjour 域名”字段不能为空";
EmptyIPv6DomainNameFieldTitle = "“IPv6 域”字段不能为空";
EmptyBonjourDomainNameFieldMsg = "指定 Bonjour 域名。";
EmptyBonjourServiceAndDomainNamesFieldTitle = "“Bonjour 服务名称/域名”字段不得为空";
EmptyBonjourServiceAndDomainNamesFieldMsg = "指定 Bonjour 服务名称/域名。";
UsedServiceNameTitle = "指定的 Bonjour 服务名称已在使用。";
UsedServiceNameMsg = "请指定其他 Bonjour 服务名称，或联系您的网络管理员获取帮助。";
HSDBonjourDomainNameTitle = "Bonjour 域名:";

// layout
HSDIPv4Title = "IPv4 设置";
HSDIPvXDisableNotAvailableDescription = "不能同时禁用 IPv4 和 IPv6。";
HSDEnableIPv4InPrinterTitle = "在打印机中启用 IPv4";
HSDConfigTitle = "配置：";
HSDNameTitle = "主机名：";
HSDAddressTitle = "IP 地址：";
HSDMaskTitle = "子网掩码：";
HSDGatewayTitle = "默认网关：";
ManualTitle = "手动";
Auto = "自动";

HSDAdditionalSettingsTitle = "其他网络设置";
HSDAdditionalSettingsDescription = "单击\"其他网络设置\"，转到打印机的嵌入式 web 服务器\"网络设置\"页面。在那里您可以配置 SNMP、802.1X 和其他网络设置。";
HSDAdditionalSettingsButton = "其他网络设置";

BonjourSettingsTitle = "Bonjour 设置";
HSDEnableBonjourTitle = "启用 Bonjour";
HSDBonjourServiceNameTitle = "Bonjour 服务名称：";
HSDPriorityTitle = "最高优先级服务：";
HSDAccessTitle = "在 URL 访问设备：";

PreviousValueString = "将使用先前的值";

HSDEnableIPv6InPrinterTitle = "在打印机中启用 IPv6";
HSDDHCPv6PolicyTitle = "DHCPv6 策略：";
HSDIPv6DomainTitle = "IPv6 域：";
HSDPrimaryDNSServerTitle = "首选 DNS 服务器：";
HSDSecondaryDNSServerTitle = "备用 DNS 服务器：";
HSDPrefixLengthTitle = "前缀长度：";
HSDAdditionalAddressesButton = "其他地址";
HSDPolicyPopUpItem1 = "启动时始终执行 DHCPv6";
HSDPolicyPopUpItem2 = "当无状态配置失败时执行 DHCPv6";
HSDPolicyPopUpItem3 = "仅当路由器发出请求时执行 DHCPv6";

HSDColumnConfigBy = "配置方式";
HSDColumnAddresses = "地址";
HSDColumnPrefix = "前缀长度";
HSDCloseButton = "关闭";

HSDApplyButton = "立即应用";

LINK_LOCAL = "本地链路";
HSDNotAvailableLabel = "网络设置任务当前不可用。\n请确保设备已连接到网络。";
